uhnp/src/InformationRegisters/ТелеграмНастройки/ТелеграмНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмНастройки</name>
  <resources>
    <name>Api</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>AdminChatId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТелеграмБот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ТелеграмНастройки/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ТелеграмБотПриИзмененииНаСервере()
	
	Запись.Token = Запись.ТелеграмБот.Token;
	
КонецПроцедуры

&НаКлиенте
Процедура ТелеграмБотПриИзменении(Элемент)
	
	ТелеграмБотПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Не ЗначениеЗаполнено(Запись.api) Тогда
		
		Запись.api = ТелеграмСерверУХ.ПолучитьТелеграмАПИПоУмолчанию();
		
	КонецЕсли;
	
КонецПроцедуры
